* STFPCS00-P2 - Membership screen: lookup and new-member save via COBOL/DB2.
* Legacy direct ADABAS access is retained for reference in prg-natural-p2/NATURAL-P2.txt
* (FIND/STORE against ADABAS-SOCIOS). This object routes persistence through STFSC00I
* (inclusion) and STFSC00C (consultation) on DB2.
*
DEFINE DATA
LOCAL
1 SOCIO
  2 NUMB-SOCIO-PRINCIPAL (N9)
  2 NOME-SOCIO-PRINCIPAL (A40)
  2 DATA-CADASTRO (D)
  2 VALR-MENSALIDADE (N6.2) (1:12)
  2 DATA-VENCIMENTO (D) (1:12)
  2 PAGAMENTO-OK (L) (1:12)
  2 CATG-SOCIO (N2)
  2 INDI-DIVIDA (N2)
  2 DATA-BAIXA (D)
  2 HORA-BAIXA (A12)
  2 OBSV-CLIENTE (A500)
  2 SUPER1 (A1)
*
1 #SOCIO-DB2-COMM
  2 COMM-OP-TYPE (A1)
  2 COMM-RETURN-CODE (A2)
  2 COMM-NUMB-SOCIO-PRINCIPAL (A9)
  2 COMM-NOME-SOCIO-PRINCIPAL (A40)
  2 COMM-DATA-CADASTRO (A10)
  2 COMM-CATG-SOCIO (A2)
  2 COMM-INDI-DIVIDA (A1)
  2 COMM-DATA-BAIXA (A10)
  2 COMM-HORA-BAIXA (A12)
  2 COMM-OBSV-SOCIO (A500)
  2 COMM-NUM-PAGAMENTOS (A4)
  2 COMM-PAGAMENTO (1:100)
    3 COMM-DATA-VENCIMENTO (A10)
    3 COMM-VALR-MENSALIDADE (A12)
    3 COMM-PAGAMENTO-OK (A1)
*
1 #MAPA
  2 #RG-CONSULTA (N7)
  2 #DIA-VENCIAMENTO (N2)
*
1 #INDICE (N2)
1 #DATA-HOJE (A8)
1 REDEFINES #DATA-HOJE
  2 #ANO (A4)
  2 #MES (A2)
  2 #DIA (A2)
*
1 #MENSAGEM
  2 #TEXTO (A72)
*
1 #NUM-PAD (N9)
END-DEFINE
*
SET KEY ALL
SET CONTROL 'M-2'
*
INPUT WITH TEXT #TEXT MARK #LOCAL MAP 'MAPSOCIO'
*
IF *PF-KEY EQ 'F3'
  INPUT NO ERASE 'Fim do processo. Aperte qualquer tecla para sair.'
  ESCAPE PROGRAM
END-IF
IF *PF-KEY NE 'ENTR'
  REINPUT FULL 'Consulte RG ou aperte F3 para sair.'
END-IF
IF #RG-CONSULTA EQ 0
  REINPUT FULL 'Informe RG do novo sócio' MARK *#RG-CONSULTA
END-IF
*
RESET #SOCIO-DB2-COMM
MOVE 'C' TO COMM-OP-TYPE
#NUM-PAD := #RG-CONSULTA
MOVE EDITED #NUM-PAD TO COMM-NUMB-SOCIO-PRINCIPAL (EM=000000000)
CALL 'STFSC00C' #SOCIO-DB2-COMM
DECIDE ON FIRST VALUE OF COMM-RETURN-CODE
  VALUE '00'
    #TEXTO := 'Sócio já cadastrado.'
    REINPUT #TEXTO
  VALUE '01'
    PERFORM INCLUI-SOCIO
  NONE VALUE
    COMPRESS 'Erro na consulta (código ' COMM-RETURN-CODE ').' INTO #TEXTO
    REINPUT #TEXTO
END-DECIDE
*
REINPUT #TEXTO
* ----------------------------------------------------------------------
DEFINE INCLUI-SOCIO
*
NUMB-SOCIO-PRINCIPAL OF SOCIO := #RG-CONSULTA
*
IF NOME-SOCIO-PRINCIPAL OF SOCIO EQ ' '
  REINPUT FULL 'Informe nome do novo Sócio.'
END-IF
*
DECIDE FOR FIRST VALUE OF *CATG-SOCIO
  VALUE 0 REINPUT FULL 'Informe a categoria.' MARK *CATG-SOCIO
  VALUE 1, 2 IGNORE
  NONE VALUE 'Categoria inválida.' MARK *CATG-SOCIO
END-DECIDE
*
IF #DIA-VENCIAMENTO EQ 0
  REINPUT FULL 'Informe a o dia do vencimento.'
END-IF
IF NOT #DIA-VENCIAMENTO EQ 1 OR EQ 5 OR EQ 15 OR EQ 20 OR EQ 25
  REINPUT FULL 'Dia do vencimento inválido.'
END-IF
*
DATA-CADASTRO OF SOCIO := *DATX
*
CALLNAT 'VERVALOR' CATG-SOCIO OF SOCIO VALR-MENSALIDADE(*) OF SOCIO
*
PAGAMENTO-OK(1) OF SOCIO := TRUE
FOR #INDICE := 2 TO 12
  PAGAMENTO-OK(#INDICE) OF SOCIO := FALSE
END-FOR
*
#DATA-HOJE := DATX (EM=YYYYMMDD)
#DIA OF #DATA-HOJE := #DIA-VENCIAMENTO
*
FOR #INDICE := 1 TO 12
  DATA-VENCIMENTO(#INDICE) OF SOCIO := #DATA-HOJE
  ADD 1 TO #MES OF #DATA-HOJE
  IF #MES OF #DATA-HOJE > 12
    #MES OF #DATA-HOJE := 1
    ADD 1 TO #ANO OF #DATA-HOJE
  END-IF
END-FOR
*
RESET INDI-DIVIDA OF SOCIO DATA-BAIXA OF SOCIO HORA-BAIXA OF SOCIO
*
IF OBSV-CLIENTE OF SOCIO EQ ' '
  OBSV-CLIENTE OF SOCIO := 'Novo sócio'
END-IF
*
RESET #SOCIO-DB2-COMM
MOVE 'I' TO COMM-OP-TYPE
#NUM-PAD := NUMB-SOCIO-PRINCIPAL OF SOCIO
MOVE EDITED #NUM-PAD TO COMM-NUMB-SOCIO-PRINCIPAL (EM=000000000)
MOVE NOME-SOCIO-PRINCIPAL OF SOCIO TO COMM-NOME-SOCIO-PRINCIPAL
MOVE EDITED DATA-CADASTRO OF SOCIO TO COMM-DATA-CADASTRO (EM=YYYY-MM-DD)
MOVE EDITED CATG-SOCIO OF SOCIO TO COMM-CATG-SOCIO (EM=99)
MOVE EDITED INDI-DIVIDA OF SOCIO TO COMM-INDI-DIVIDA (EM=9)
RESET COMM-DATA-BAIXA COMM-HORA-BAIXA
MOVE OBSV-CLIENTE OF SOCIO TO COMM-OBSV-SOCIO
MOVE '0012' TO COMM-NUM-PAGAMENTOS
FOR #INDICE := 1 TO 12
  MOVE EDITED DATA-VENCIMENTO(#INDICE) OF SOCIO TO COMM-DATA-VENCIMENTO(#INDICE) (EM=YYYY-MM-DD)
  MOVE EDITED VALR-MENSALIDADE(#INDICE) OF SOCIO TO COMM-VALR-MENSALIDADE(#INDICE) (EM=99999999.99)
  IF PAGAMENTO-OK(#INDICE) OF SOCIO
    MOVE 'Y' TO COMM-PAGAMENTO-OK(#INDICE)
  ELSE
    MOVE 'N' TO COMM-PAGAMENTO-OK(#INDICE)
  END-IF
END-FOR
*
CALL 'STFSC00I' #SOCIO-DB2-COMM
DECIDE ON FIRST VALUE OF COMM-RETURN-CODE
  VALUE '00'
    #TEXTO := 'Novo sócio incluído com sucesso.'
  VALUE '02'
    #TEXTO := 'Sócio já cadastrado.'
  NONE VALUE
    COMPRESS 'Erro na inclusão (código ' COMM-RETURN-CODE ').' INTO #TEXTO
END-DECIDE
*
END-SUBROUTINE
* ----------------------------------------------------------------------
ON ERROR
  COMPRESS 'ERRO ' *ERROR ' NA LINHA ' *ERROR-LINE INTO #TEXTO
  REINPUT #TEXTO
END-ERROR
END
