DEFINE DATA 
LOCAL
* Estrutura de dados do socio (antes VIEW OF ADABAS-SOCIOS).
1 SOCIO
  2 NUMB-SOCIO-PRINCIPAL (N9)
  2 NOME-SOCIO-PRINCIPAL (A40)
  2 DATA-CADASTRO (D)
  2 VALR-MENSALIDADE (P7.2/1:12)
  2 DATA-VENCIMENTO (D/1:12)
  2 PAGAMENTO-OK (L/1:12)
  2 CATG-SOCIO (I2)
  2 INDI-DIVIDA (I2)
  2 DATA-BAIXA (D)
  2 HORA-BAIXA (T)
  2 OBSV-CLIENTE (A500)
  2 SUPER1 (A1)
*
* Area de ligacao com COBOL (espelha LOCAL/LDA-STFSC.txt e BKSTFSC.cpy).
1 #STFSC-LK
  2 #STF-RETCODE (A2)
  2 #STF-NUMB-SOCIO-PRINCIPAL (N9)
  2 #STF-NOME-SOCIO-PRINCIPAL (A40)
  2 #STF-DATA-CADASTRO (A10)
  2 #STF-CATG-SOCIO (I2)
  2 #STF-INDI-DIVIDA (I2)
  2 #STF-DATA-BAIXA (A10)
  2 #STF-DATA-BAIXA-IND (I2)
  2 #STF-HORA-BAIXA (A12)
  2 #STF-HORA-BAIXA-IND (I2)
  2 #STF-OBSV-CLIENTE (A500)
  2 #STF-DATA-VENCIMENTO (A10/1:12)
  2 #STF-VALR-MENSALIDADE (P7.2/1:12)
  2 #STF-PAGAMENTO-OK (A1/1:12)
*
1 #MAPA
  2 #RG-CONSULTA (N7) 
  2 #DIA-VENCIAMENTO (N2)
*
1 #INDICE (N2)
1 #DATA-HOJE (A8)
1 REDEFINES #DATA-HOJE
  2 #ANO
  2 #MES
  2 #DIA
*
1 #MENSAGEM
  2 #TEXTO (A72)
END-DEFINE
*
SET KEY ALL
SET CONTROL 'M-2'
*
INPUT WITH TEXT #TEXT MARK #LOCAL MAP 'MAPSOCIO'
*
IF *PF-KEY EQ 'F3'
  INPUT NO ERASE 'Fim do processo. Aperte qualquer tecla para sair.'
  ESCAPE PROGRAM
END-IF
IF *PF-KEY NE 'ENTR'
  REINPUT FULL 'Consulte RG ou aperte F3 para sair.'
END-IF
IF #RG-CONSULTA EQ 0
  REINPUT FULL 'Informe RG do novo sócio' MARK *#RG-CONSULTA
END-IF
*
* ADABAS: FIND SOCIO WITH NUMB-SOCIO-PRINCIPAL EQ #RG-CONSULTA
* ADABAS:   IF NO
* ADABAS:     PERFORM INCLUI-SOCIO
* ADABAS:     ESCAPE BOTTOM
* ADABAS:   END-NOREC
* ADABAS:   #TEXTO := 'Sócio já cadastrado.'
* ADABAS: END-FIND
*
RESET #STFSC-LK
MOVE #RG-CONSULTA TO #STF-NUMB-SOCIO-PRINCIPAL
CALL 'STFSC00C' #STFSC-LK
IF #STF-RETCODE = '01'
  PERFORM INCLUI-SOCIO
ELSE
  IF #STF-RETCODE = '00'
    PERFORM STFSC-LK-PARA-SOCIO
    #TEXTO := 'Sócio já cadastrado.'
  ELSE
    COMPRESS 'Erro consulta DB2. RC=' #STF-RETCODE INTO #TEXTO
  END-IF
END-IF

REINPUT #TEXTO
* ----------------------------------------------------------------------
DEFINE INCLUI-SOCIO
*
NUMB-SOCIO-PRINCIPAL := #RG-CONSULTA

IF NOME-SOCIO-PRINCIPAL EQ ' '
  REINPUT FULL 'Informe nome do novo Sócio.'
END-IF
*
DECIDE FOR FIRST VALUE OF *CATG-SOCIO
  VALUE 0 REINPUT FULL 'Informe a categoria.' MARK *CATG-SOCIO
  VALUE 1, 2  IGNORE
  NONE VALUE 'Categoria inválida.' MARK *CATG-SOCIO
END-DECIDE
*
IF #DIA-VENCIAMENTO EQ 0
 REINPUT FULL 'Informe a o dia do vencimento.'
END-IF
IF NOT #DIA-VENCIAMENTO EQ 1 OR EQ 5 OR EQ 15 OR EQ 20 OR EQ 25
 REINPUT FULL 'Dia do vencimento inválido.'
END-IF
*
DATA-CADASTRO := *DATX
*
* Busca valor da mensalidade por categoria do novo cliente
CALLNAT 'VERVALOR' CATG-SOCIO VALR-MENSALIDADE(*) 
*
* Todo o novo sócio já precisa ter a primeira mensalidade paga
PAGAMENTO-OK(1) := TRUE
PAGAMENTO-OK(2:11) := FALSE
*
#DATA-HOJE := DATX (EM=YYYYMMDD)
#DIA       := #DIA-VENCIAMENTO
*
FOR #INDICE = 1 TO 12
  DATA-VENCIMENTO(#INDICE) := #DATA-HOJE
  ADD 1 TO #MES
  IF #MES > 12
    #MES = 1
    ADD 1 TO #ANO
  END-IF
END-FOR
*
RESET INDI-DIVIDA DATA-BAIXA HORA-BAIXA
*
IF OBSV-CLIENTE EQ ' '
  OBSV-CLIENTE := 'Novo sócio'
END-IF
*
* ADABAS: STORE
PERFORM STFSC-SOCIO-PARA-LK
CALL 'STFSC00I' #STFSC-LK
IF #STF-RETCODE = '00'
  #TEXTO := 'Novo sócio incluído com sucesso.'
ELSE
  IF #STF-RETCODE = '98'
    #TEXTO := 'Sócio já cadastrado.'
  ELSE
    COMPRESS 'Erro gravação DB2. RC=' #STF-RETCODE INTO #TEXTO
  END-IF
END-IF
*
END-SUBROUTINE
* ----------------------------------------------------------------------
DEFINE STFSC-SOCIO-PARA-LK
RESET #STFSC-LK
MOVE NUMB-SOCIO-PRINCIPAL TO #STF-NUMB-SOCIO-PRINCIPAL
MOVE NOME-SOCIO-PRINCIPAL TO #STF-NOME-SOCIO-PRINCIPAL
MOVE EDITED DATA-CADASTRO TO #STF-DATA-CADASTRO (EM=YYYY-MM-DD)
MOVE CATG-SOCIO TO #STF-CATG-SOCIO
MOVE INDI-DIVIDA TO #STF-INDI-DIVIDA
MOVE -1 TO #STF-DATA-BAIXA-IND
MOVE -1 TO #STF-HORA-BAIXA-IND
MOVE OBSV-CLIENTE TO #STF-OBSV-CLIENTE
FOR #INDICE = 1 TO 12
  MOVE EDITED DATA-VENCIMENTO(#INDICE) TO #STF-DATA-VENCIMENTO(#INDICE) (EM=YYYY-MM-DD)
  MOVE VALR-MENSALIDADE(#INDICE) TO #STF-VALR-MENSALIDADE(#INDICE)
  IF PAGAMENTO-OK(#INDICE)
    MOVE '1' TO #STF-PAGAMENTO-OK(#INDICE)
  ELSE
    MOVE '0' TO #STF-PAGAMENTO-OK(#INDICE)
  END-IF
END-FOR
END-SUBROUTINE
* ----------------------------------------------------------------------
DEFINE STFSC-LK-PARA-SOCIO
MOVE #STF-NUMB-SOCIO-PRINCIPAL TO NUMB-SOCIO-PRINCIPAL
MOVE #STF-NOME-SOCIO-PRINCIPAL TO NOME-SOCIO-PRINCIPAL
MOVE EDITED #STF-DATA-CADASTRO TO DATA-CADASTRO (EM=YYYY-MM-DD)
MOVE #STF-CATG-SOCIO TO CATG-SOCIO
MOVE #STF-INDI-DIVIDA TO INDI-DIVIDA
IF #STF-DATA-BAIXA-IND EQ -1
  RESET DATA-BAIXA
ELSE
  MOVE EDITED #STF-DATA-BAIXA TO DATA-BAIXA (EM=YYYY-MM-DD)
END-IF
IF #STF-HORA-BAIXA-IND EQ -1
  RESET HORA-BAIXA
ELSE
  MOVE #STF-HORA-BAIXA TO HORA-BAIXA
END-IF
MOVE #STF-OBSV-CLIENTE TO OBSV-CLIENTE
FOR #INDICE = 1 TO 12
  MOVE EDITED #STF-DATA-VENCIMENTO(#INDICE) TO DATA-VENCIMENTO(#INDICE) (EM=YYYY-MM-DD)
  MOVE #STF-VALR-MENSALIDADE(#INDICE) TO VALR-MENSALIDADE(#INDICE)
  IF #STF-PAGAMENTO-OK(#INDICE) EQ '1'
    PAGAMENTO-OK(#INDICE) := TRUE
  ELSE
    PAGAMENTO-OK(#INDICE) := FALSE
  END-IF
END-FOR
END-SUBROUTINE
* ----------------------------------------------------------------------
ON ERROR
  COMPRESS 'ERRO ' *ERROR ' NA LINHA ' *ERROR-LINE INTO #TEXTO
  REINPUT #TEXTO
END-ERROR
END
