DEFINE DATA 
LOCAL USING SOCIOXCOM
LOCAL
* Estrutura de tela / regra (antes VIEW OF ADABAS-SOCIOS)
1 SOCIO
  2 NUMB-SOCIO-PRINCIPAL (N9)
  2 NOME-SOCIO-PRINCIPAL (A40)
  2 DATA-CADASTRO (D)
  2 VALR-MENSALIDADE (P6.2) (12)
  2 DATA-VENCIMENTO (D) (12)
  2 PAGAMENTO-OK (L) (12)
  2 CATG-SOCIO (N2)
  2 INDI-DIVIDA (N4)
  2 DATA-BAIXA (D)
  2 HORA-BAIXA (A12)
  2 OBSV-CLIENTE (A500)
*
1 #MAPA
  2 #RG-CONSULTA (N7) 
  2 #DIA-VENCIAMENTO (N2)
*
1 #INDICE (N2)
1 #DATA-HOJE (A8)
1 REDEFINES #DATA-HOJE
  2 #ANO (A4)
  2 #MES (A2)
  2 #DIA (A2)
*
1 #MENSAGEM
  2 #TEXTO (A72)
END-DEFINE
*
SET KEY ALL
SET CONTROL 'M-2'
*
INPUT WITH TEXT #TEXT MARK #LOCAL MAP 'MAPSOCIO'
*
IF *PF-KEY EQ 'F3'
  INPUT NO ERASE 'Fim do processo. Aperte qualquer tecla para sair.'
  ESCAPE PROGRAM
END-IF
IF *PF-KEY NE 'ENTR'
  REINPUT FULL 'Consulte RG ou aperte F3 para sair.'
END-IF
IF #RG-CONSULTA EQ 0
  REINPUT FULL 'Informe RG do novo sócio' MARK *#RG-CONSULTA
END-IF
*
MOVE #RG-CONSULTA TO SOCIO-RG
*
* Legado ADABAS: FIND SOCIO WITH NUMB-SOCIO-PRINCIPAL EQ #RG-CONSULTA
CALL 'STFSSC00C' SOCIO-COMMAREA
IF SOCIO-RETURN-CODE = '01'
  PERFORM INCLUI-SOCIO
ELSE
  IF SOCIO-RETURN-CODE = '00'
    #TEXTO := 'Sócio já cadastrado.'
  ELSE
    COMPRESS 'Erro na consulta DB2. RC=' SOCIO-RETURN-CODE INTO #TEXTO
  END-IF
END-IF

REINPUT #TEXTO
* ----------------------------------------------------------------------
DEFINE INCLUI-SOCIO
*
NUMB-SOCIO-PRINCIPAL := #RG-CONSULTA

IF NOME-SOCIO-PRINCIPAL EQ ' '
  REINPUT FULL 'Informe nome do novo Sócio.'
END-IF
*
DECIDE FOR FIRST VALUE OF *CATG-SOCIO
  VALUE 0 REINPUT FULL 'Informe a categoria.' MARK *CATG-SOCIO
  VALUE 1, 2  IGNORE
  NONE VALUE 'Categoria inválida.' MARK *CATG-SOCIO
END-DECIDE
*
IF #DIA-VENCIAMENTO EQ 0
 REINPUT FULL 'Informe a o dia do vencimento.'
END-IF
IF NOT #DIA-VENCIAMENTO EQ 1 OR EQ 5 OR EQ 15 OR EQ 20 OR EQ 25
 REINPUT FULL 'Dia do vencimento inválido.'
END-IF
*
* Legado ADABAS: DATA-CADASTRO := *DATX (tela); DB2 recebe ISO via MOVE EDITED
DATA-CADASTRO := *DATX
MOVE EDITED *DATX TO SOCIO-DATA-CADASTRO WITH MASK 'YYYY-MM-DD'
*
* Busca valor da mensalidade por categoria do novo cliente
CALLNAT 'VERVALOR' CATG-SOCIO VALR-MENSALIDADE(*) 
*
* Todo o novo sócio já precisa ter a primeira mensalidade paga
PAGAMENTO-OK(1) := TRUE
PAGAMENTO-OK(2:11) := FALSE
*
#DATA-HOJE := DATX (EM=YYYYMMDD)
#DIA       := #DIA-VENCIAMENTO
*
FOR #INDICE = 1 TO 12
  DATA-VENCIMENTO(#INDICE) := #DATA-HOJE
  MOVE EDITED #DATA-HOJE TO SOCIO-DATA-VENC(#INDICE) WITH MASK 'YYYY-MM-DD' EM=YYYYMMDD
  ADD 1 TO #MES
  IF #MES > 12
    #MES = 1
    ADD 1 TO #ANO
  END-IF
END-FOR
*
RESET INDI-DIVIDA DATA-BAIXA HORA-BAIXA
*
IF OBSV-CLIENTE EQ ' '
  OBSV-CLIENTE := 'Novo sócio'
END-IF
*
MOVE #RG-CONSULTA TO SOCIO-RG
MOVE NOME-SOCIO-PRINCIPAL TO SOCIO-NOME
MOVE CATG-SOCIO TO SOCIO-CATG
MOVE INDI-DIVIDA TO SOCIO-INDI-DIVIDA
MOVE OBSV-CLIENTE TO SOCIO-OBSV
MOVE SPACES TO SOCIO-DATA-BAIXA SOCIO-HORA-BAIXA
FOR #INDICE = 1 TO 12
  MOVE VALR-MENSALIDADE(#INDICE) TO SOCIO-VALR-MENS(#INDICE)
  IF PAGAMENTO-OK(#INDICE)
    MOVE 'T' TO SOCIO-PAG-OK(#INDICE)
  ELSE
    MOVE 'F' TO SOCIO-PAG-OK(#INDICE)
  END-IF
END-FOR
*
* Legado ADABAS: STORE
CALL 'STFSSC00I' SOCIO-COMMAREA
DECIDE FOR FIRST VALUE OF SOCIO-RETURN-CODE
  VALUE '00'
    #TEXTO := 'Novo sócio incluído com sucesso.'
  VALUE '02'
    #TEXTO := 'Sócio já cadastrado.'
  NONE VALUE
    COMPRESS 'Erro na inclusão DB2. RC=' SOCIO-RETURN-CODE INTO #TEXTO
END-DECIDE
*
END-SUBROUTINE
* ----------------------------------------------------------------------
ON ERROR
  COMPRESS 'ERRO ' *ERROR ' NA LINHA ' *ERROR-LINE INTO #TEXTO
  REINPUT #TEXTO
END-ERROR
END
