DEFINE DATA
LOCAL USING 'STFSCB00'
LOCAL
* 1 SOCIO VIEW OF ADABAS-SOCIOS
1 SOCIO
  2  NUMB-SOCIO-PRINCIPAL
  2  NOME-SOCIO-PRINCIPAL
  2  DATA-CADASTRO
  2  C*PERIODICO-PAGAMENTO
  2  VALR-MENSALIDADE (12)
  2  DATA-VENCIMENTO (12)
  2  PAGAMENTO-OK (12)
  2  CATG-SOCIO
  2  INDI-DIVIDA
  2  DATA-BAIXA
  2  HORA-BAIXA
  2  OBSV-CLIENTE
*
1 #MAPA
  2 #RG-CONSULTA (N7)
  2 #DIA-VENCIAMENTO (N2)
*
1 #INDICE (N2)
1 #DATA-HOJE (A8)
1 REDEFINES #DATA-HOJE
  2 #ANO
  2 #MES
  2 #DIA
*
1 #MENSAGEM
  2 #TEXTO (A72)
END-DEFINE
*
SET KEY ALL
SET CONTROL 'M-2'
*
INPUT WITH TEXT #TEXT MARK #LOCAL MAP 'MAPSOCIO'
*
IF *PF-KEY EQ 'F3'
  INPUT NO ERASE 'Fim do processo. Aperte qualquer tecla para sair.'
  ESCAPE PROGRAM
END-IF
IF *PF-KEY NE 'ENTR'
  REINPUT FULL 'Consulte RG ou aperte F3 para sair.'
END-IF
IF #RG-CONSULTA EQ 0
  REINPUT FULL 'Informe RG do novo sócio' MARK *#RG-CONSULTA
END-IF
*
* FIND SOCIO WITH NUMB-SOCIO-PRINCIPAL EQ #RG-CONSULTA
*   IF NO
*     PERFORM INCLUI-SOCIO
*     ESCAPE BOTTOM
*   END-NOREC
*   #TEXTO := 'Sócio já cadastrado.'
* END-FIND
*
STFSCB00-OPERACAO := 'C'
STFSCB00-NUMB-SOCIO-PRINC := #RG-CONSULTA
CALLNAT 'STFSC00C' STFSCB00-COMUNICACAO
*
DECIDE FOR FIRST VALUE STFSCB00-RETURN-CODE
  VALUE '+0100'
    PERFORM INCLUI-SOCIO
  VALUE '+0000'
    #TEXTO := 'Sócio já cadastrado.'
  VALUE '+0803'
    #TEXTO := 'Sócio já cadastrado (chave duplicada).'
  NONE VALUE
    COMPRESS 'Erro na consulta COBOL/DB2' STFSCB00-RETURN-CODE
      INTO #TEXTO
END-DECIDE
*
REINPUT #TEXTO
* ----------------------------------------------------------------------
DEFINE INCLUI-SOCIO
*
NUMB-SOCIO-PRINCIPAL := #RG-CONSULTA
*
IF NOME-SOCIO-PRINCIPAL EQ ' '
  REINPUT FULL 'Informe nome do novo Sócio.'
END-IF
*
DECIDE FOR FIRST VALUE OF *CATG-SOCIO
  VALUE 0 REINPUT FULL 'Informe a categoria.' MARK *CATG-SOCIO
  VALUE 1, 2  IGNORE
  NONE VALUE 'Categoria inválida.' MARK *CATG-SOCIO
END-DECIDE
*
IF #DIA-VENCIAMENTO EQ 0
 REINPUT FULL 'Informe a o dia do vencimento.'
END-IF
IF NOT #DIA-VENCIAMENTO EQ 1 OR EQ 5 OR EQ 15 OR EQ 20 OR EQ 25
 REINPUT FULL 'Dia do vencimento inválido.'
END-IF
*
DATA-CADASTRO := *DATX
*
* Busca valor da mensalidade por categoria do novo cliente
CALLNAT 'VERVALOR' CATG-SOCIO VALR-MENSALIDADE(*)
*
* Todo o novo sócio já precisa ter a primeira mensalidade paga
PAGAMENTO-OK(1) := TRUE
PAGAMENTO-OK(2:11) := FALSE
*
#DATA-HOJE := DATX (EM=YYYYMMDD)
#DIA       := #DIA-VENCIAMENTO
*
FOR #INDICE = 1 TO 12
  DATA-VENCIMENTO(#INDICE) := #DATA-HOJE
  ADD 1 TO #MES
  IF #MES > 12
    #MES = 1
    ADD 1 TO #ANO
  END-IF
END-FOR
*
RESET INDI-DIVIDA DATA-BAIXA HORA-BAIXA
*
IF OBSV-CLIENTE EQ ' '
  OBSV-CLIENTE := 'Novo sócio'
END-IF
*
* STORE
PERFORM GRAVA-SOCIO-COBOL
*
END-SUBROUTINE
* ----------------------------------------------------------------------
DEFINE GRAVA-SOCIO-COBOL
*
PERFORM TRANSFERE-PARA-COBOL
STFSCB00-OPERACAO := 'I'
CALLNAT 'STFSC00I' STFSCB00-COMUNICACAO
*
DECIDE FOR FIRST VALUE STFSCB00-RETURN-CODE
  VALUE '+0000'
    #TEXTO := 'Novo sócio incluído com sucesso.'
  VALUE '+0803'
    #TEXTO := 'Sócio já cadastrado (chave duplicada).'
  NONE VALUE
    COMPRESS 'Erro na inclusão COBOL/DB2' STFSCB00-RETURN-CODE
      INTO #TEXTO
END-DECIDE
*
END-SUBROUTINE
* ----------------------------------------------------------------------
DEFINE TRANSFERE-PARA-COBOL
*
STFSCB00-NUMB-SOCIO-PRINC := NUMB-SOCIO-PRINCIPAL
STFSCB00-NOME-SOCIO-PRINC := NOME-SOCIO-PRINCIPAL
STFSCB00-CATG-SOCIO := CATG-SOCIO
*
MOVE EDITED DATA-CADASTRO (EM=YYYY-MM-DD) TO STFSCB00-DATA-CADASTRO
*
IF INDI-DIVIDA
  STFSCB00-INDI-DIVIDA := 'Y'
ELSE
  STFSCB00-INDI-DIVIDA := 'N'
END-IF
*
IF DATA-BAIXA NE 0
  MOVE EDITED DATA-BAIXA (EM=YYYY-MM-DD) TO STFSCB00-DATA-BAIXA
ELSE
  STFSCB00-DATA-BAIXA := ' '
END-IF
*
IF HORA-BAIXA NE 0
  MOVE EDITED HORA-BAIXA (EM=HH:MM) TO STFSCB00-HORA-BAIXA
ELSE
  STFSCB00-HORA-BAIXA := ' '
END-IF
*
STFSCB00-OBSV-SOCIO := OBSV-CLIENTE
STFSCB00-C-PERIODICO := 12
*
FOR #INDICE = 1 TO 12
  MOVE EDITED DATA-VENCIMENTO(#INDICE) (EM=YYYY-MM-DD)
    TO STFSCB00-DATA-VENC(#INDICE)
  STFSCB00-VALR-MENSAL(#INDICE) := VALR-MENSALIDADE(#INDICE)
  IF PAGAMENTO-OK(#INDICE)
    STFSCB00-PAGAMENTO-OK(#INDICE) := 'Y'
  ELSE
    STFSCB00-PAGAMENTO-OK(#INDICE) := 'N'
  END-IF
END-FOR
*
END-SUBROUTINE
* ----------------------------------------------------------------------
ON ERROR
  COMPRESS 'ERRO ' *ERROR ' NA LINHA ' *ERROR-LINE INTO #TEXTO
  REINPUT #TEXTO
END-ERROR
END
