DEFINE DATA
LOCAL USING 'STFSC00L'
*
1 SOCIO-DIALOG
  2 NOME-SOCIO-PRINCIPAL (A40)
  2 CATG-SOCIO (N2)
  2 OBSV-CLIENTE (A500)
*
1 #MAPA
  2 #RG-CONSULTA (N7)
  2 #DIA-VENCIAMENTO (N2)
*
1 #INDICE (N2)
1 #DATA-HOJE (A8)
1 REDEFINES #DATA-HOJE
  2 #ANO (A4)
  2 #MES (A2)
  2 #DIA (A2)
*
1 #MENSAGEM
  2 #TEXTO (A72)
END-DEFINE
*
SET KEY ALL
SET CONTROL 'M-2'
*
INPUT WITH TEXT #TEXT MARK #LOCAL MAP 'MAPSOCIO'
*
IF *PF-KEY EQ 'F3'
  INPUT NO ERASE 'Fim do processo. Aperte qualquer tecla para sair.'
  ESCAPE PROGRAM
END-IF
IF *PF-KEY NE 'ENTR'
  REINPUT FULL 'Consulte RG ou aperte F3 para sair.'
END-IF
IF #RG-CONSULTA EQ 0
  REINPUT FULL 'Informe RG do novo sócio' MARK *#RG-CONSULTA
END-IF
*
* --- Migracao DBATDP-13: ADABAS substituido por COBOL/DB2 (consulta) ---
* FIND SOCIO WITH NUMB-SOCIO-PRINCIPAL EQ #RG-CONSULTA
*   IF NO
*     PERFORM INCLUI-SOCIO
*     ESCAPE BOTTOM
*   END-NOREC
*   #TEXTO := 'Sócio já cadastrado.'
* END-FIND
*
RESET STFSC00-COMUNICACAO
STFSC00-OPERACAO := 'C'
STFSC00-NUMB-SOCIO-PRINCIPAL := #RG-CONSULTA
CALLNAT 'STFSC00C' STFSC00-COMUNICACAO
DECIDE ON FIRST VALUE OF STFSC00-SQLCODE
  VALUE 100
    PERFORM INCLUI-SOCIO
  VALUE 0
    #TEXTO := 'Sócio já cadastrado.'
  NONE VALUE
    COMPRESS 'ERRO DB2' STFSC00-SQLCODE INTO #TEXTO
END-DECIDE
*
REINPUT #TEXTO
* ----------------------------------------------------------------------
DEFINE INCLUI-SOCIO
*
STFSC00-NUMB-SOCIO-PRINCIPAL := #RG-CONSULTA
STFSC00-NOME-SOCIO-PRINCIPAL := SOCIO-DIALOG.NOME-SOCIO-PRINCIPAL

IF SOCIO-DIALOG.NOME-SOCIO-PRINCIPAL EQ ' '
  REINPUT FULL 'Informe nome do novo Sócio.'
END-IF
*
STFSC00-CATG-SOCIO := SOCIO-DIALOG.CATG-SOCIO
DECIDE FOR FIRST VALUE OF SOCIO-DIALOG.CATG-SOCIO
  VALUE 0 REINPUT FULL 'Informe a categoria.' MARK *CATG-SOCIO
  VALUE 1, 2  IGNORE
  NONE VALUE 'Categoria inválida.' MARK *CATG-SOCIO
END-DECIDE
*
IF #DIA-VENCIAMENTO EQ 0
 REINPUT FULL 'Informe a o dia do vencimento.'
END-IF
IF NOT #DIA-VENCIAMENTO EQ 1 OR EQ 5 OR EQ 15 OR EQ 20 OR EQ 25
 REINPUT FULL 'Dia do vencimento inválido.'
END-IF
*
MOVE EDITED *DATX (EM=YYYY-MM-DD) TO STFSC00-DATA-CADASTRO
*
* Busca valor da mensalidade por categoria do novo cliente
CALLNAT 'VERVALOR' SOCIO-DIALOG.CATG-SOCIO STFSC00-VALR-MENSALIDADE(*)
*
* Todo o novo sócio já precisa ter a primeira mensalidade paga
STFSC00-PAGAMENTO-OK(1) := 'Y'
STFSC00-PAGAMENTO-OK(2:12) := 'N'
*
#DATA-HOJE := *DATX (EM=YYYYMMDD)
#DIA       := #DIA-VENCIAMENTO
*
FOR #INDICE = 1 TO 12
  MOVE EDITED #DATA-HOJE (EM=YYYY-MM-DD) TO STFSC00-DATA-VENCIMENTO(#INDICE)
  ADD 1 TO #MES
  IF #MES > 12
    #MES = 1
    ADD 1 TO #ANO
  END-IF
END-FOR
*
STFSC00-INDI-DIVIDA := 'N'
RESET STFSC00-DATA-BAIXA STFSC00-HORA-BAIXA
*
IF SOCIO-DIALOG.OBSV-CLIENTE EQ ' '
  SOCIO-DIALOG.OBSV-CLIENTE := 'Novo sócio'
END-IF
STFSC00-OBSV-SOCIO := SOCIO-DIALOG.OBSV-CLIENTE
STFSC00-C-PERIODICO-PAGAMENTO := 12
*
* --- Migracao DBATDP-13: ADABAS substituido por COBOL/DB2 (inclusao) ---
* STORE
STFSC00-OPERACAO := 'I'
CALLNAT 'STFSC00I' STFSC00-COMUNICACAO
DECIDE ON FIRST VALUE OF STFSC00-SQLCODE
  VALUE 0
    #TEXTO := 'Novo sócio incluído com sucesso.'
  VALUE +803
    #TEXTO := 'Sócio já cadastrado.'
  NONE VALUE
    COMPRESS 'ERRO DB2' STFSC00-SQLCODE INTO #TEXTO
END-DECIDE
*
END-SUBROUTINE
* ----------------------------------------------------------------------
ON ERROR
  COMPRESS 'ERRO ' *ERROR ' NA LINHA ' *ERROR-LINE INTO #TEXTO
  REINPUT #TEXTO
END-ERROR
END
